#1)შექმენით ცვლადი სადაც შეინახავთ ინტეჯერ ტიპის მონაცემს,შემდეგ შეამოწმეთ თუ ეს რიცხვი რომელიც ცვლადში გაქვთ შენახული მეტია 10 ზე დაპრინტეთ "more than 10" სხვა შემთხვებაში დაპრინტეთ "less than 10"
number = 15
if number > 10:
    print("more than 10")
else:
    print("less than 10")

#2)მომხმარებელს შემოაყვანინეთ რიცხვი,შემდეგ შეამოწმეთ თუ ეს რიცხვი უდრის 15 ს დაუპრინტეთ "equal to 15" სხვა შემთხვევაში დაუპრინტეთ "not equal to 15"
your_age = int(input("შეიყვანეთ წლოვანება: "))
if your_age == 15:
    print("equal to 15")
else:
    print("not equal to 15")

#3)მომხმარებელს შემოატანეთ სტრინგი შენი დავალებაა შეამოწმო,თუ მომხამრებლის მიერ შემოყვანილი სტრინგი არის giorgi დაუპრინტეთ 'you are correct" სხვა შემთხვევაში დაუპრინტეთ "you are wrong"
"password" = input("შეიყვანეთ პაროლი: ")
if "password" == "petrepavle123":
    print("you are connected")
else:
    print("wrong password, try again")

#4)დაატრიალეთ ფორ ციკლი 50 დან 100 მდე 5 ის გამოტოვებით




#5)ფორ ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი
for i in range(20):
    print("თქვენი სახელი")
    print("თქვენი გვარი")


#6)while loop ის დახმარებით ტერმინალში გამოიტანეთ რიცხვები 20 დან 50 მდე
i = 20
while i <= 50:
    print(i)
    i += 1
