# 1) შექმენით სია რომელშიც იქნება მხოლოდ int მონაცემთა ტიპის ელემენტები, ამ სიიდან ამოშალე ყოველი რიცხვი რომელიც არის ლუწი ან დგას კენტ ინდექსზე სიაში, გამოიყენეთ remove() ფუნქცია და for ციკლი.

listt = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

for i in range(len(listt)):
    if listt[i] % 2 == 0 or i % 2 == 1:
        listt.remove(listt[i])

print(listt)


# 2) შექმენით სია რომელშიც იქნება მხოლოდ სტრინგ მონაცემთა ტიპის ელემენტები, ამ სიის ბოლოში ცალ-ცალკე მეორედ ჩაამატე ყველა ის სიტყვა რაც უკვე არის ამ სიაში, გამოიყენეთ for ციკლი და სიის შესაბამისი ფუნქცია.

listi = ["qwe" , "rty", "uio", "asd", "fgh"]

listi22 = listi[:]

for i in listi22:
    listi.append(i)

print(listi)


# 3) შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით, რიცხვებით სავსე სიიდან, სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. გამოიყენეთ for ციკლი და შესაფერისი სიის ფუნქცია.

list1 = [10, 25, 30, 45, 60, 75, 90]

list2 = ["vashli" , "banani" , "gela"]

for i in list1:
    if i > 20 and i < 50:
        list2.append(str(i))

print(list2)


# 4) შექმენით სიტყვებით სავსე სია და ამ სიაში ყველა ისეთ სიტყვას რომელიც იწყება პატარა ასოთი, პირველი ასო გაუხადეთ დიდი. გამოიყენეთ for ციკლი და სტრინგის შესაბამისი ფუნქცია.

list3 = ["vashli" , "Gela" , "jora" , "pepela"]

for i in range(len(list3)):
    if list3[i][0] == list3[i][0].lower():
        list3[i] = list3[i].capitalize()

print(list3)


# 5) თქვენი სიტყვებით ახსენით რას აკეთებს გავლილი მასალიდან ყველა შესწავლილი სიის და სტრინგის ფუნქციები და for ციკლი.

#append()  ამატებს ელემენტს სიაში
#remove()  ამოშლის ელემენტს სიიდან
#index()  აბრუნებს ელემენტის ინდექსს სიაში
#len()  აბრუნებს სიაში ელემენტების რაოდენობას





