#for ციკლის მეშვეობით გამოიტანეთ რიცხვები 10-ის ჩათვლით
for i in range(11):
    print(i)

#while ციკლის მეშვეობით გამოიტანეთ რიცხვები 5-დან 20-მდე.

i = 5
while i < 20:
    print(i)
    i += 1

#კომენტარების სახით ახსენით რა არის conditional statement, რა დანიშნლება გააჩნიათ და როგორი სახის განცხადებები გვაქვს.

# Conditional statement არის პროგრამირების ენის ნაწილი, რომელიც საშუალებას გვაძლევს გავაკეთოთ გადაწყვეტილებები გარკვეული პირობების საფუძველზე.
# მათი დანიშნულება არის პროგრამის ნაკადის კონტროლი, რათა შევძლოთ სხვადასხვა მოქმედებების შესრულება სხვადასხვა პირობების მიხედვით.
# გვაქვს რამდენიმე სახის conditional statements, როგორიცაა if, else, და elif.

#მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ თუ ასაკი იქნება მეტი ან ტოლი 18-ის მაშინ გამოუტანოს რომ იგი ზრდასრულია, ხოლო თუ იქნება 18-ზე ნაკლები საბოლოო გზის მეშვეობით გამოუტანეთ რომ ის მოზარდია.

age = int(input("შეიყვანეთ თქვენი ასაკი: "))
if age >= 18:
    print("თქვენი ასაკი: ", age, " - თქვენ ხართ ზრდასრული.")
else:
    print("თქვენი ასაკი: ", age, " - თქვენ ხართ მოზარდი.")