#1)შექმენით სია საცად მოათავსებტ 7 ადამიანის სახელს,თქვენი დავალებაა რომ ტერმინალში გამოიტანოთ ყველა ელემენტი ცალ ცალკე მინუს ინდექსებით

names = ["ნიკა", "მარიამი", "გიორგი", "თათია", "ლაშა", "ნანა", "ზურა"]

print(names[-1])
print(names[-2])
print(names[-3])
print(names[-4])
print(names[-5])
print(names[-6])
print(names[-7])

#2)შექმენით 5 ცვლადი და შეინახეთეთ მათში სახელები,თქვენი დავალებაა რომ შეადგინოთ სია ამ ცვლადების გამოყენებით(გამოიყენეთ რათქმაუნდა ცვლადის სახელები),სიის შექმნის შემდეგ გამოიტანეთ ტერმინალში სიაში მყოფი ბოლო ელემენტი(გამოიყენეთ მინუს ინდექსები)

name1 = "ნიკა"
name2 = "მარიამი"
name3 = "გიორგი"
name4 = "თათია"
name5 = "ლაშა"

names = [name1, name2, name3, name4, name5]

print(names[-1])



#3)შექმენით ცვლადი და შეინახეთ მნიშვნელობა "irakli" თქვენი დავალებაა რომ ინდექსინგის გამოყენებით ტერმინალში გამოიტანოთ ასო ბგერა K როგორც დადებით ასევე უარყოფითი ინდექსით

name = "irakli"

print(name[2])
print(name[-4])
