#1) შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
# --> გამოიტანეთ პირველი 5 ელემენტი
# --> გამოიტანეთ ბოლო 3 ელემენტი
# --> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით

list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print(list[:5])
print(list[7:])
print(list[3:8])


# 2) შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
# --> გამოიტანეთ პირველი 6 ელემენტი
# --> გამოიტანეთ ბოლო 10 ელემენტი
# --> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)

list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

print(list1[:-9])
print(list1[-10:])
print(list1[-8:-1])


# 3) მოცემულია სიტვა 'თვითმფრინავი'
# გამოიტანეთ 'ნავი'

word = "თვითმფრინავი"

print(word[8:])


# 4) მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
# --> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით

word1 = "Programmer"

print(word1[:3])
print(word1[:-7])


# 5) შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:
# --> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)
# --> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)

week_days = ["ორშაბათი", "სამშაბათი", "ოთხშაბათი", "ხუთშაბათი", "პარასკევი", "შაბათი", "კვირა"]

print(week_days[:5])
print(week_days[:-2])

print(week_days[5:])
print(week_days[-2:])



# 6) მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->
# გამოიტანეთ: 
# 'Python'
# 'slicing'
# 'powerful'
# გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსები

# ??????????????????????????????????????????????????














