
#1)კომენტარის სახით ახსენით თუ რა არის index და რაში ვიყენებთ მას

# Index არის ელემენტის მდებარეობა სიაში, სტრიქონში ან სხვა მონაცემთა სტრუქტურაში. მას ვიყენებთ იმისთვის, რომ მივწვდეთ კონკრეტულ ელემენტს, შევცვალოთ ან წავშალოთ იგი.


#2)შექმენით ცვლადი სადაც შეინახავთ ამ სიას [4,6,1,5,9,8,4] ,თქვენი დავალებაა რომ მიწვდეთ ამ სიაში ელემენტებს ინდექსინგის გამოყენებით ,შეკრიბეთ ორი რიცხვი რომ მიიღთ შემდეგი რიცხვები --> 10 , 2 , 14 , 20 , 4 , 7 , 27 , გამოიყენეთ მათემატიკური ოპერატოებირები

my_list = [4, 6, 1, 5, 9, 8, 4]
result_10 = my_list[0] + my_list[1]  # 4 + 6 = 10
result_2 = my_list[1] - my_list[0]   # 6 - 4 = 2
result_14 = my_list[0] + my_list[4]   # 4 + 9 = 13
result_20 = my_list[1] + my_list[5] + my_list[0]  # 6 + 8 + 4 = 18
result_4 = my_list[0]                       # 4 = 4
result_7 = my_list[0] + my_list[2]         # 4 + 1 + 2 = 7
result_27 = my_list[1] + my_list[4] + my_list[  5] + my_list[6]  # 6 + 9 + 8 + 4 = 27   

#3)შექმენით სია სადაც შეიყვანთ ადამიანის სახელებს,უნდა გქონდეთ სულ 10 სახელი,თქვენი დავალებაა რომ გამოიტანოტ ,მე 5 , მე 9 ,მე 3 ,მე 7 და პირველ ინდექსზე მდგომი ელემენტები ცალ ცალკე,გამოიყენეთ ინდექსინგი

names = ["ანა", "გიორგი", "მარიამი", "ნიკა", "თამარი", "ლუკა", "სოფო", "დავით", "ეკა", "თემო"]

print("მე 5-ე ელემენტი:", names[4])      # თამარი
print("მე 9-ე ელემენტი:", names[8])      # ეკა
print("მე 3-ე ელემენტი:", names[2])      # მარიამი
print("მე 7-ე ელემენტი:", names[6])      # სოფო
print("პირველ ინდექსზე მდგომი ელემენტი:", names[0]) # ანა




