
# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

name = input("enter a name: ")
print(name.upper())

# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით

surname = input("enter your surname with big numbers: ")
print(surname.lower())

# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი

nickname = input("enter a nickname: ")
print(nickname.capitalize())

# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით

name = ["data", "zuria", "gela", "vaja"]
for i in name:
    print(i.upper())

# 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით

NAMEE = ["SABA", "VAJA", "ROROSHA", "GELA"]
for i in NAMEE:
    print(i.lower())

# 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს
name1 = ["mate", "saba", "ivane", "nica", "vaja"]
for i in name1:
    print(i.capitalize())

# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს

listt = ["qwe" , "rty", "uiop", "asd", "fgh", "jkl", "zxcvbnm", "qsxrgbukj,", "qazwsxedc4rfv"]
print(len(listt))

# 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს

wordd = "tvalebs ro xuwav brmavdebi"
print(len(wordd))

# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

# for loopitaa ricxvebi da magitoa am sigrdze xelit mezareboda wera

ricxvebi = [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

count = 0

for i in ricxvebi:
    if i % 2 == 0:
        count += 1

print("amount of even: ", count)  

# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა

ricxvebi = [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15
            ]
count1 = 0

for i in ricxvebi:
    if i % 2 != 0:
        count1 += 1

print("amount of odd: ", count1)  


# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები
# ```

start = int(input("enter a number (start): "))
end = int(input("enter a number 2 (end):  "))
step = int(input("enter a step (step): "))

for i in range(start, end, step):
    if i % 2 == 0:
        print(i)









        