# 1)შექმენი ფუნქცია, რომელსაც აქვს ერთი პარამეტრი —name.
# ფუნქციამ უნდა დააბრუნოს ტექსტი:
# გამარჯობა, [სახელი]!

# ფუნქცია გამოიძახე სხვადასხვა არგუმენტით მინიმუმ 3-ჯერ

def my_name(name):

    return "hello", [name]

print(my_name("mate"))


# 2)შექმენი ფუნქცია, რომელსაც აქვს ორი პარამეტრი — num1 და num2.
# ფუნქციამ უნდა დააბრუნოს მათი ჯამი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def numbers(num1, num2):

    return num1 + num2

print(numbers(5, 3))
print(numbers(10, 20))
print(numbers(-4, 7))
print(numbers(0, 100))


# 3)შექმენი ფუნქცია ერთი პარამეტრით num.

# ფუნქციამ უნდა დააბრუნოს (return) გადაცემული რიცხვის კვადრატი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def num(num3, num4):

    return num3 ** num4

print(numbers(4, 9))
print(numbers(1, 3))
print(numbers(2, 2))
print(numbers(5, 9))
print(numbers(7, 4))


# 4)შექმენი ფუნქცია ერთი პარამეტრით — age.

# თუ ასაკი არის 18 ან მეტი, დააბრუნოს:
# სრულწლოვანი ხარ

# სხვა შემთხვევაში:
# არ ხარ სრულწლოვანი


def weli(age):

    if age == 18 or age > 18:
        return "სრულწლოვანი ხარ"

    else:
        return "არ ხარ სრულწლოვანი"


# 5)შექმენი ფუნქცია ერთი პარამეტრით — (string).

# ფუნქციამ უნდა დაბეჭდოს ტექსტის სიმბოლოების რაოდენობა.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def strin(string):

    return len(string)

print(strin("hello"))
print(strin("world"))
print(strin("python"))
print(strin("css"))


# 7)შექმენი ფუნქცია ერთი პარამეტრით — score.

# თუ ქულა ≥ 90 → დააბრუნოს "შესანიშნავი ქულა"

# თუ ქულა >= 70 და ნაკლებია ან <=89 → დააბრუნოს "კარგი ქულა"

# თუ ქულა >= 50 და <= 69 → დააბრუნოს "დამაკმაყოფილებელი ქულა"

# სხვა შემთხვევაში დააბრუნოს "ჩაჭრილი"

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def scor(score):

    if score >= 90:
        return "შესანიშნავი ქულა"
    
    elif 70 <= score <= 89:
        return "კარგი ქულა"
    
    elif 50 <= score <= 69:
        return "დამაკმაყოფილებელი ქულა"
    
    else:
        return "ჩაჭრილი"

print(scor(90))
print(scor(80))
print(scor(70))
print(scor(60))


# 8)შექმენი ფუნქცია ერთი პარამეტრით — number.

# ფუნქციამ უნდა დააბრუნოს, ლუწია თუ კენტი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def numb(number):

    if number % 2 == 0:
        return "even"

    else:
        return "odd"

print(numb(2))
print(numb(7))
print(numb(11))
print(numb(473))


# 9)შექმენი ფუნქცია ერთი პარამეტრით — name

# ფუნქციამ უნდა დააბრუნოს მხოლოდ პირველი ასო.

# მაგალითად:
# „Giorgi“ → G

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def nam(name):

    return name[0]

print(nam("Elene"))
print(nam("Giorgi"))
print(nam("Gela"))


# 10)შექმენი ფუნქცია სამი num1 num2 num3.

# ფუნქციამ უნდა დააბრუნოს ამ სამი რიცხვის საშუალო არითმეტიკული.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def mid(num5, num6, num7):

    return (num5 + num6 + num7) / 3

print(mid(5, 2, 0))
print(mid(7, 3, 9))
print(mid(11, 5, 7))
print(mid(9, 1, 4))


# 11)შექმენი ფუნქცია ერთი პარამეტრით —password.

# თუ პაროლი უდრის "python123" → დააბრუნოს  "წვდომა დაშვებულია"

# სხვა შემთხვევაში → "არასწორი პაროლი"

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def passw(password):

    if password == "python123":
        return "წვდომა დაშვებულია"

    else:
        return "არასწორი პაროლი"

print(passw("python123"))
print(passw("pyhton1234"))
print(passw("pyhton1235"))
print(passw("pyhton1236"))
print(passw("pyhton1237"))


# 12)შექმენი ფუნქცია ერთი პარამეტრით — text.

# ფუნქციამ უნდა დააბრუნოს ეს ტექსტი მთლიანად დიდი ასოებით.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def tex(text):

    return text

print("gela".upper())
























