# 1) მომხმარებელს შემოატანინე სიტყვა ანდა ტექსტი.
# -> გაიგე ამ სიტყვის/ტექსტის სიგრძე და დაპრინტე 
# -> for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

inputt = input("enter something: ")

print(len(inputt))

for i in range(len(inputt)):
    print(inputt[i])


# 2)  შექმენით სია სადაც შეინახავთ სტრინგებს.
# დაუარეთ სიის თითოეულ ელემენტს:
# 1. დაპრინტეთ რამდენი სიმბოლოსაგან შედგება სიტყვა
# 2. თუ სიტყვის სიგრძე არის: 
# --> კენტი დაპრინტეთ  'კენტია'
# --> ლუწი დაპრინტეთ 'ლუწია'

strings = ['mate', 'saba', 'giga', 'daviti', 'nika', 'jora', 'gela']

for i in strings:
    print("ეს სიტყვა შედგება ", len(i), "სიმბოლოსგან")

    if len(i) % 2 == 0:
        print("ლუწია")

    else:
        print("კენტია")







