# ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True

print(50 > 30 or 30 == 31)
print(25 < 39 or 10 < 8)
print(30 == 30 or 20 < 17)
print(164>125 or 0==1)
print(185<200 and 200==200)


print(15 < 60 and 70 == 69)
print(18 == 20 and 60 > 20)
print(164 < 170 and 1 == 2)
print(104<200 and 200==199)
print(120>133 or 0==1)

# კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით

#sequancing - კოდის წაკითხვა ზემოდან ქვემოთ
#interaction - გამეორება, მეორდება სულ
#selection - არჩევანი

#მოიყვანე secuencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence
print("mate arabuli")

print("13")

print("1.75")

#ეს მაგალითი არის sequence იმიტომ რომ, კოდი მაღლიდან ქვევით ჩამოდის. 
#ჯერ იპრინტება სახელი გვარი, შემდეგ წლოვანება და ბოლოს სიმაღლე

#კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის

#for loop გვიმეორებს ჩვენს მიერ ჩაწერილ სიტყვას/რიცხვს

#კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop

#range ფუნქცია გვიმეორებს რიცხვებს მაგალითად for i in range(10):
#for loop გამოიყენება თანმიმდევრობის იტერაციისთვის

#შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop




#შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ

for i in range(100):
    print("arabuli")

#შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ

for i in range(46):
    print("chorni")

#შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ

for i in range(32):
    print("M")









