# # ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True

print(50 > 30 or 30 == 31)
print(25 < 39 or 10 < 8)
print(30 == 30 or 20 < 17)
print(164>125 or 0==1)
print(185<200 and 200==200)


print(15 < 60 and 70 == 69)
print(18 == 20 and 60 > 20)
print(164 < 170 and 1 == 2)
print(104<200 and 200==199)
print(120>133 or 0==1)

# # # # კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით

# # # #sequancing - კოდის წაკითხვა ზემოდან ქვემოთ
# # # #interaction - გამეორება, მეორდება სულ
# # # #selection - არჩევანი

# # # #მოიყვანე secuencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence
print("mate arabuli")

print("13")

print("1.75")

# #ეს მაგალითი არის sequence იმიტომ რომ, კოდი მაღლიდან ქვევით ჩამოდის. 
# #ჯერ იპრინტება სახელი გვარი, შემდეგ წლოვანება და ბოლოს სიმაღლე

# #კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის

# #for loop გვიმეორებს ჩვენს მიერ ჩაწერილ სიტყვას/რიცხვს

# #კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop

# #range ფუნქცია გვიმეორებს რიცხვებს მაგალითად for i in range(10):
# #for loop გამოიყენება თანმიმდევრობის იტერაციისთვის

# #შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop

# #


# #შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ

for i in range(100):
    print("arabuli")
    print(20)

# # #შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ

for i in range(46):
    print("chorni")

# # # #შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ

for i in range(32):
    print("M")

# # #მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია(გამოიყენე შესაბამისი ფუნქცია რომ მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია)

name = input("enter your name: ")
surname = input("enter your surname: ")
hobby = input("enter your hobby: ")
age = input("enter your age: ")

overall = (name + surname + hobby + age)

# # #შექმენი 4 ცვლადი,თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები,შენი დავალებაა გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი(გამოიყენე შესაბამისი ფუნქცია)

name1 = "mate"
surname1 = "arabuli"
age1 = 13
height = 1.75
is_adult = False

print(type(name1))
print(type(surname1))
print(type(age1))
print(type(height))
print(type(is_adult))

# #მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამი

num1 = int(input("enter a number: "))
num2 = int(input("enter a number: "))
num3 = int(input("enter a number: "))
num4 = int(input("enter a number: "))

sum_numbers = (num1 + num2 + num3 + num4)
print(sum_numbers)









