# 1) შექმენით სია სადაც შეინახავთ სხვადასხვა ქალაქების სახელებს.  
#    for loop ით დაბეჭდეთ მხოლოდ ის ქალაქები, რომელთა სახელის სიგრძე მეტია 6-ზე.


listt = ["თბილისი", "ბათუმი", "ქუთაისი", "გორი", "ზუგდიდი", "ფოთი", "რუსთავი"]

for city in listt:
    if len(city) > 6:
        print(city)


# 2) შექმენით სია სხვადასხვა სიტყვებით.  
# -> for loop-ით დაბეჭდეთ მხოლოდ ის სიტყვები, რომელთა სიგრძე ზუსტად იყოფა 15-ზე.

words = ["პროგრამირება", "ინფორმატიკა", "ტექნოლოგია", "კომპიუტერი", "მობილურიაპლიკაცია", "ინტერნეტი"]

for word in words:
    if len(word) % 15 == 0:
        print(word)


# 3) შექმენით სია რიცხვებით.  
# -> გამოიყენეთ for loop რათა დათვალოთ რამდენი რიცხვია სიაში.  
# -> არ გამოიყენოთ len() — დაითვალეთ ხელით.

numbers = [10, 25, 33, 47, 58, 69, 72, 81, 94]

count = 0
for num in numbers:
    count = 1 + count
    print(count)


# 4) შექმენით სია სხვადასხვა სიტყვებით.  
# -> for loop-ით დაბეჭდეთ მხოლოდ ის სიტყვები, რომელთა სიგრძე ზუსტად 5 სიმბოლოა.

sityva = ["პროგრამა", "ინფორმაცია", "ტექნოლოგია", "კომპიუტერი", "მობილური", "ინტერნეტი"]

for word in sityva:
    if len(word) == 5:
        print(word)


    # 5) მომხმარებელს შემოატანინე წინადადება.  
    # -> გაიგე რამდენი სიმბოლოა წინადადებაში.  
    # -> for ციკლით დათვალე რამდენი  "a" ან "A" არის ტექსტში.


inputt = input("შეიყვანეთ წინადადება: ")

print("წინადადების სიგრძე:", len(inputt))

count = 0
for i in inputt:
    if i == "a" or i == "A":
        count = 1 + count

print("წინადადებაში 'a' ან 'A' სიმბოლოების რაოდენობა:", count)



# 6) <= Boss Level =>
# შექმენით სია სადაც შეინახებთ სხვადასხვა სტრინგებს.
# --> დაპრინტეთ ამ სიიდან ყველაზე გრძელი სტრინგი















