#1) მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
#--> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
#--> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
#--> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'

valid_number = (input("შეიყვანეთ რიცხვი: "))

if valid_number < 0:
    print("ეს რიცხვი უარყოფითი რიცხვია")

elif valid_number > 0:
    print("ეს რიცხვი დადებითი რიცხვია")

else:
    print("ეს რიცხვი ნულია")


#2) მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'

age = (input("შემოიყვანეთ თქვენი ასაკი: "))

if age < 0-12:
    print("ბავშვი ხარ")
elif age <= 13-19:
    print("მოზარდი/თინეიჯერი ხარ")
elif age <= 20-64:
    print("ზრდასრული ხარ")
elif age <= 65-120:
    print("ხანში შესული ხარ")
elif age <= 120:
    print("გურუ ან ჯადოქარი")
else:
    print("არასწორი ინფო")


#3) დაწერეთ "password guesser" პროგრამა, შექმენით რაიმე ცვლადი და მასში შეინახეთ ის პაროლი რომელსაც ყველგან იყენებთ ;)
# მომხმარებელს მოთხოვეთ გამოიცნოს თქვენი პაროლი
# აღნიშნეთ ცდების რაოდენობა
# გამოიყენეთ while loop, მანამ ატრიალეთ სანამ მომხმარებელი პაროლს არ გამოიცნობს ან დაწერს --> 'nah strong password'
# ბოლოს აჩვენეთ(დაუპრინტეთ) რამდენი ცდა დაჭირდა პაროლის გამოსაცნობად

attempts = 0
password = "petrepavle20"

while True:
    guess = input("გამოიცნეთ პაროლი: ")
    attempts += 1
    if guess == password:
        print("პაროლი სწორია!")
        break
    elif guess == "nah strong password":
        print("პაროლი არასწორია!")
        break

print(f"ცდების რაოდენობა: {attempts}")  #{attempts} aqcevs stringad da itvlis ramdenjer dagvwirda parolis gamosacnobad


#4) მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი

#??


#5) შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'

day = (input("შემოიყვანეთ კვირის დღე: "))

if day == 1:
    print("ორშაბათი")
elif day == 2:
    print("სამშაბათი")
elif day == 3:
    print("ოთხშაბათი")
elif day == 4:
    print("ხუთშაბათი")
elif day == 5:
    print("პარასკევი")
elif day == 6:
    print("შაბათი")
elif day == 7:
    print("კვირა")
else:
    print("არ ვიცი ეგ რა დღეა")








