# 1) for ციკლით დაბეჭდე რიცხვები 1 დან 50 მდე.  
#    თუ რიცხვი ლუწია -> დაბეჭდე "ლუწი"
#    თუ კენტია -> "კენტი"  
#    ფორმატით:  
#    1 კენტია  
#    2 ლუწი


for i in range(1, 50):

    if i % 2 == 0:
        print("ლუწი")

    elif i % 2 == 1:
        print("კენტი")


# 2) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    - თუ რიცხვი იყოფა 3-ზე -> "იყოფა 3-ზე"  
#    - თუ რიცხვი იყოფა 5-ზე -> "იყოფა 5-ზე"  
#    - თუ ორივეზე იყოფა -> "იყოფა 3-ზე და 5-ზე" 
#    - სხვაგვარად -> "არ იყოფა არცერთზე"


for i in range(20):

    if i % 3 == 0:
        print("იყოფა 3-ზე")

    elif i % 5 == 0:
        print("იყოფა 5-ზე")

    elif i % 3 == 0 and i % 5 == 0:
        print("იყოფა 3-ზე და 5-ზე")

    else:
        print("არ იყოფა არცერთზე")


# 3) მომხმარებელს შემოატანინე რიცხვი. 
#    for ციკლით დაითვალე რამდენი ლუწი და რამდენი კენტი რიცხვია დიაპაზონში 0-დან შემოტანილ რიცხვამდე.  
#    დაბეჭდე შედეგი ამ ფორმატით:  
#    ლუწი რიცხვების რაოდენობა: X  
#    კენტი რიცხვების რაოდენობა: Y

X = 0

Y = 0

inputt = int(input("enter a number: "))

for i in range(0, inputt):
    
    if i % 2 == 0:
        X = X + 1

    elif i % 2 == 1:
        Y = Y + 1

print(X)
print(Y)


# 4) მოცემულია სია -> [10, 25, 33, 47, 80, 99]  
#    for ციკლით დაუარე თითოეულ ელემენტს.  
#    თუ ელემენტი მეტია 50 ზე -> "მეტი 50-ზე" 
#    თუ ნაკლებია 50 ზე -> "ნაკლები 50-ზე".


list2 = [10, 25, 33, 47, 80, 99] 

for i in list2:

    if i > 50:
        print("მეტი 50-ზე")

    elif i < 50:
        print("ნაკლები 50-ზე")



# 5) for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 0 დან 100 მდე.  
#    ბოლოს დაბეჭდე -> "ლუწი რიცხვების ჯამია: X".

X1 = 0

for i in range(100):

    if i % 2 == 0:
        print(i)
        X1 = X1 + i

print("ლუწი რიცხვების ჯამია: ", X1)


# 6) შექმენი სია და შეინახეთ შიგნით სტრინგები  
#    for ციკლით დაბეჭდე მხოლოდ ის სიტყვები, რომლებიც იწყება ასო "a" ზე.


list2 = ["mate, saba, andria, ana, gia, giorgi"]

for i in list2:
    
    if i[0] == "a":
        print(i)


# 7) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    თუ რიცხვი არის ნული -> "ნულია"  
#    თუ კენტია -> "კენტია"  
#    თუ ლუწია -> "ლუწია".


for i in range(20):

    if i == 0:
        print("ნულია")

    elif i % 2 == 1:
        print("კენტია")

    elif i % 2 == 0:
        print("ლუწია")


# 8) შექმენი სია -> [5, 15, 25, 35, 45, 55] 
#    for ციკლით დაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც იყოფა 5 ზე


list3 = [5, 15, 25, 35, 45, 55] 

for i in list3:
    
    if i % 5 == 0:
        print(i)


# 9) მომხმარებელს შემოატანინე სიტყვა.  
#    for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

input2 = input("enter a name: ")

for i in input2:
    print(i)


# 10) შექმენი ცვლადი -> total = 0  
#     for ციკლით დაამატე 1 დან 10 მდე ყველა რიცხვი total-ში.  
#     ბოლოს დაბეჭდე -> "ჯამი არის: X".

total = 0

for i in range(1, 10):
    total = total + i  

print("ჯამი არის: ", total)









