#1)კომენტარის სახით ჩამოწერეთ რომელი მონაცემთა ტიპები ვისწავლეთ და თთეულს გვერდით მიუწერეთ 1 მაგალითი

#სტრინგი - "mate"

#ინტეჯერი - 23

#ფლოათი - 3.151

#ბულიანი - true


#2)ტერმინალში გამოიტანეთ 1 სტრინგი 1 ინტეჯერი 1 ფლოუთი 1 ბულეანი

string = "mate"

print(string)


integer = 25

print(integer)


float = 3.151

print(float)


boolean = True

print(boolean)


# #3)შექმენი 4 ცვლადი snake_case ის გამოყენებით,1 ში შეინახე სტრინგი მეორეში ინტეჯერი მესამეში ბულეანი მეოთხეში ფლოუთი,დაპრინტე თითოეული ამთგანი(გამოიყენე ცვლადის სახელები)



# #4)შექმენი 2 ცვლადი სადაც შეინახავ ინტეჯერ ტიპის მონაცემებს,თქვენი დავალებაა რომ ამ ორ რიცხვზე მოახდინოთ ყველა მათემატიკური მოქმედება რაც ვისწავლეთ

num1 = 20
num2 = 5

print(num1 - num2)

print(num1 + num2)

print(num1 * num2)

print(num1 / num2)


# #5)შექმენი ორი ცვლადი შეინახე ორივეში სტრინგები და შეკრიბე ეს ორი სტრინგი,ასევე კომენტარის სახით დაწერე რა ეწოდება ამ მოქმედებას(სტრინგების შეერთებას)

cvladi = "mate"
cvladi1 = "arabuli"

print(cvladi + cvladi1) #ამ მოქედებას ეწოდება კონკატინაცია


# #6)კომენტარის სახით ახსენით თითოეული რას აკეთებს და მოიყვანე თითო მაგალით --> % , // , 

# #Bouns
# # ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:


# 15 / 3 = 5

# 20 / 4 = 5

# 15 // 10 =

# 10 // 7 =

# 4 * 3 = 12

# 40 * 3 = 120

# 120 * 3 = 360

# 4 ** 3 = 

# 10 ** 3 =

# 10 % 7 =

# 3 % 2 =


# #8)კომენტარის სახით ახსენით თთოეული რას აკეთებს --> str() , int() , float(),მოიყვანე თითო მაგალითი სამივე მათგანზე


#str()   str(input("ჩაწერეთ რიცხვი"))

#int()   int(input(ჩაწერეთ თქვენი სახელი))

#float()   float(int("ჩაწერეთ წილადი რიცხვი"))


# #9)შექმენი 4 ცვლადი სადაც შეინახავ განსხვავებული ტიპის მონაცემებს,შენი დავალებაა რომ დაბეჭდო მათი ტიპები,გამოიყენე ნასწავლი ფუნქცია რომელიც იგებდა ფრჩხილებში გადაცემული 
# #ელემენტის ტიპს

str = "mate"

int = 20

float = 3.141

boolean = False

print(str)



# #10)მომხმარებელს შემოატანინე ორი რიცხვი,შენი დავალეაბაა ამ ორ რიცხვზე მოახდინოთ შედარების ოპერაციები(გამოიყენე ყველა შედარების ოპერატორი რაც ვისწავლეთ),

num3 = int(input("enter a first number: "))

num4 = int(input("enter a second number: "))

if num3 > num4:
    print()


# #11)კომენტარის სახით ახსენით რომელი ლოგიკური ოპერატორები ვისწავლეთ და რომლის გამოყენების დროს რა ხდება,მოიყვანე თითო მაგალითი 

#or - მიეკუთვნება true-ს  false or true = true

#and - მიეკუთვნება false-ს  false and true = false


# #12)გვერდით მიუწერეთ პასუხები წერტილების მაგივრად
True and True -- True       |   True or True -- True
True and False -- False     |   True or False -- True
False and True -- False     |   False or True -- True
False and False -- False    |   False or False -- False


# #13)გვერდით მიუწერეთ საბოლოო პასუხი წერტილების მაგივრად
5 == 10 and 10 <= 10 -- False  |   True or "giorgi" == "giorgi" -- True
True and False -- False        |   10 < 2 or "lasha" == "beqa" -- False
10 > 3 and 5 == 3 -- False     |   2 >= 3 or 40 < 2 -- False
True and 200 <= 200 -- True    |   4 == 3 or 50 > 300 -- False


# #14)ტერმინალში გამოიტანეთ თქვენი რიცხვები 5 იდან 200 მდე for loop

for i in range(5, 200):
    print(i)


# #15)ტერმინალში გამოიტანეთ რიცვები 100 დან 150 მდე 5 ის სტეპის გამოტოვებით for loop

for i in range(100, 150, 5):
    print(i)


# #16)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ for loop

for i in range("mate"):
    print(i)

# #17)ტერმინალში გამოიტანეთ თქვენი რიცხვები 10 იდან 50 მდე while loop

i = 10

while i > 50:
    print(i)
    i = i + 1


# #18)ტერმინალში გამოიტანეთ რიცვები 50 დან 150 მდე 10 ის სტეპის გამოტოვებით while loop

i = 50

while i < 150:
    print(i)
    i = i + 10


# #19)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ while loop

i = "mate"

while i > 10:
    print(i)
    i = i + 1


#20) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი და for loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი

list = ["mate", "saba", "nika", "giorgi", "dato"]

for i in range():
    print(i)


#21) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი და while loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი 

list1 = ["A", "B", "C", "D", "E"]


while list1 > 5:
    print(list1)
    i = i + 1


#22)შექმენი სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"],შენი დავალებაა ამ სიიდან გამოიტანო  საბა და იამზე როგორც დადებით ასევე უარყოფითი ინდექსების
#გამოყენებით

list3 = ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]

print(list3[2])
print(list3[5])

print(list3[-4])
print(list3[-1])


# #23)შექმენი ცვლადი სადაც შეინახავ სტრინგს --> 'ჰიდროელექტროსადგური" , შენი დავალებაა რომ გამოიტანო მესამე და მერვე ინდექსზე მდგომი ასოები ტერმინალში

word = "ჰიდროელექტროსადგური"

print(word[2])
print(word[7])


# #24)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებ რიცხვს , შემდეგ --> თუ მომხმარებლის მიერ შემოტანილი რიცცხვი არის 0 ზე მეტი დაუპრინტე -->"more than 0" , თუ მომხმარებლის მიერ
# # შემოტანილი რიცხვი არის 0 ზე ნაკლები დაუპრინტე --> "Less than 0",სხვა შემთხვევაშიდ აუპრინტე --> "Equal 0"

input = int(input("enter a number"))

if input > 0:
    print("more than 0")

elif input == 0:
    print("equal to 0")

else:
    input < 0
    print("less than 0")


# #25)შექმენი ცვლადი სადაც შეინახავ ადამიანების სახელებს(6 ცალი) სიას-->შემდეგ შეამოწმეთ --> თუ ამ სიაში მესამე ინდექსზე მდგომი ელემენტი არის "lasha" -->დაუპრინტე --> "You 
# #choose lasha" , თუ სიაში მყოფი ბოლო ინდექსზე მდგომი ელემენტი არის "giorgi" მაშინ დაუპრინტე -->"you choose giorgi" , სხვა შემთხვევაში დაუპრინტე --> "you choose other name"

names = "mate"

names1 = "saba"

names2 = "goga"

names3 = "lasha"

names4 = "nika"

names5 = "giorgi"


input = (input("enter a name: "))

if input == names3:
    print("you chose lasha")

elif input == names5:
    print("you chose giorgi")

else:
    print("you chose other name")


#26)
# შექმენი ცვლადი სადაც შეინახავ პაროლს

# მომხმარებელს შემოატანინე პაროლი

# სანამ პირობა არის ჭეშმარიტი(True)

# თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:

# დაპრინტე --> გამოიცანი

# break

# სხვა შემთხვევაში:

# თავიდან გაუმეორე რომ შემოიყვანოს პაროლი


password = "zangigela123"

input = (input("enter a password: "))

while input == True:
    print(input)
    i = i + 1

if input == False:
    print("პაროლი არასწორეა, ცადეთ თავიდან")

else:
    input == True
    print("გამოიცანით პაროლი, საღოლ")











