# 1)შექმენი სია 7 რიცხვით.

# დაბეჭდე პირველი და ბოლო ელემენტების ნამრავლი ისე, რომ ორივეჯერ უარყოფითი ინდექსი გამოიყენო.

# დაბეჭდე მესამე ელემენტი მარცხნიდან და მესამე ელემენტი მარჯვნიდან (უარყოფითიინდექსის გამოყენებით).


numbers = [2, 4, 6, 8, 10, 12, 14]


print(numbers[-1])
print(numbers[-7])



#2)შექმენი სია "apple", "banana", "cherry", "grape", "kiwi", "orange".

# დაბეჭდე შუა 2 ელემენტი (ორივე(დადებითი და უარყოფითი)) ინდექსით.


fruits = ["apple", "banana", "cherry", "grape", "kiwi", "orange"]

print(fruits[2])
print(fruits[3])

print(fruits[-3])
print(fruits[-4])


#3)
# შექმენი [3,4,5,6,7,1,2,9,8,11]

# მომხმარებელს შემოატანინე ერთი ინდექსი(რიცხვი) 0 დან 10 მდე.

# თუ მომხმარებლის ინდექსი დადებითია → დაბეჭდე ის ელემენტი

# თუ უარყოფით რიცხვი ან  10 ზე მეტი მაღალირიცხვი შემოიყვანა დაბეჭდეთ --> "you entered negative or more than 10  number "


numbers1 = [1,2,3,4,5,6,7,8,9,10]


idk = int(input("enter a number between 0 and 10"))


if idk == numbers1:
    print("თქვენი ინდექსი დადებითია")          #??????

else:
    print("თქვენ რიცხვი უარყოფითია ან მეტი 10-ზე")



#





