#2) კომენტარების სახით თავიდან ახსენით რა არის conditional statement, რა დანიშუნლება გააჩნიათ და როგორი სახის განცხადებები გვაქვს.

# Conditional statement - გამოხატოს ურთიერთობა პირობასა და შედეგად მიღებულ შედეგს შორის. 
# გვაქვს რამდენიმე სახის conditional statements, მათ შორის:
# - if statement: გამოიყენება გარკვეული პირობის შესამოწმებლად და შესაბამისი ქმედების შესასრულებლად.
# - if-else statement: გამოიყენება ორი შესაძლო შედეგის შესამოწმებლად და შესაბამისი ქმედების შესასრულებლად.

#3) for ციკლის მეშვეობით გამოიტანეთ "hello world" 50-ჯერ.

for i in range(50):
    print("hello world")

#4) while ციკლის მეშვეობით გამოიტანეთ რიცხვები 3-დან 17-ის ჩათვლით.

i = 3
while i <= 17:
    print(i)
    i += 1

#5) მომხმარებელს შემოატანინეთ პაროლი, შემდეგ კი შედეგი შეინახეთ ცვლადში. შექმენით პირობა თუ ის უდრის "1234"-ს დაბეჭდეთ "Password is correct", სხვა შემთხვევაში დაბეჭდეთ "Password is incorrect".

password = input("შეიყვანეთ პაროლი: ")
if password == "1234":
    print("Password is correct")
else:
    print("Password is incorrect")

#6) შექმენით ცვლადი სადაც შეინახავთ მომხმარებლის მიერ შემოყვანილი ცხოველის სახეობას. თუ სახეობა უდრის "ძაღლი" დაბეჭდეთ "woaf! woaf!", სხვა შემთხვევაში "შენ არ გყავს ძაღლი"

dog = input("შეიყვანეთ თქვენი ცხოველის სახეობა: ")
if dog == "ძაღლი":
    print("woaf! woaf!")
else:
    print("ძაღლი არ გყავს")

#7) უყურეთ შემდეგ ვიდეო წყაროსს:

# -- https://youtu.be/FvMPfrgGeKs --



















