#1) კომენტარის სახით ჩამოწერეთ  რომელი ახალი მათემატიკური ოპერატორები ვისწავლეთ,თითოეულ მათგანს მიუწერეთ  რომელი რას აკეთებს და თითოზე მოიყვანე სამ-სამი მაგალითი

# დღეს ვისწავლეთ სამი ოპერატორი: //, %, **

# // ოპერატორი გვიბრუნებს ინტეჯერ ტიპის მონაცემს
# მაგალითები:
# 5 // 2 = 2
# 9 // 4 = 2
# 15 // 6 = 2

# % ოპერატორი აკეთებს ნაშთების გამოთვლას
# მაგალითები:
# 5 % 2 = 1
# 9 % 4 = 1
# 15 % 6 = 3

# ** ოპერატორი გვეხმარება ავიყვანოთ რიცხვი ხარისხში
# მაგალითები:
# 2 ** 3 = 8
# 3 ** 2 = 9
# 4 ** 2 = 16


#2)კომენტარის სახით ახსენიტ თუ რითი განსხვავდებიან ერთმანეთისგან სიები და ცვლადები,და ასევე დაწერე თუ რაში ვიყენებთ სიებს

# ცვლადი არის ერთეული მონაცემი, რომელიც შეიძლება იყოს რიცხვი, ტექსტი ან სხვა ტიპის მონაცემი.

# მაგალითი: x = 10


# სიები (lists) არის მონაცემთა სტრუქტურა, რომელიც შეიცავს რამდენიმე ელემენტს ერთიანად.

# სიები გამოიყენება მაშინ, როცა გვინდა ერთიანად შევინახოთ და მოვუშვათ რამდენიმე მონაცემი.

# მაგალითი: my_list = [1, 2, 3]


#3)შექმენი სია რომელსაც შეინახავთ ცვლადში,ამ სიაში უნდა გქონდეს ყველა მონაცემთა ტიპის ელემენტი რომელიც ვისწავლეთ,სიის შექმნის შემდეგ დაპრინტეთ ეს სია
my_list = [10, 3.14, "Hello", True]
print(my_list)